;******************************************************************************
;* TI ARM G3 C/C++ Codegen                                        Unix v18.12.1.LTS *
;* Date/Time created: Fri Mar 22 23:49:50 2019                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embedded_constants=on --endian=little --float_support=FPv4SPD16 --hll_source=on --object_format=elf --silicon_version=7M4 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../thirdparty/simplelink/source/socket.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen Unix v18.12.1.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/home/vishal/workspace_v8/My_project/Debug")
$C$DW$1	.dwtag  DW_TAG_variable
	.dwattr $C$DW$1, DW_AT_name("g_pCB")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("g_pCB")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$370)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$1, DW_AT_decl_column(0x17)

	.global	_SlSockSocketCmdCtrl
	.sect	".const:_SlSockSocketCmdCtrl"
	.align	2
	.elfsym	_SlSockSocketCmdCtrl,SYM_SIZE(4)

	.dwattr $C$DW$T$364, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$364, DW_AT_decl_line(0x432)
	.dwattr $C$DW$T$364, DW_AT_decl_column(0x02)


$C$DW$T$365	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$365, DW_AT_byte_size(0x01)
$C$DW$472	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$472, DW_AT_name("SOCKET_0")
	.dwattr $C$DW$472, DW_AT_const_value(0x00)
	.dwattr $C$DW$472, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$472, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$472, DW_AT_decl_column(0x02)

$C$DW$473	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$473, DW_AT_name("SOCKET_1")
	.dwattr $C$DW$473, DW_AT_const_value(0x01)
	.dwattr $C$DW$473, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$473, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$473, DW_AT_decl_column(0x02)

$C$DW$474	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$474, DW_AT_name("SOCKET_2")
	.dwattr $C$DW$474, DW_AT_const_value(0x02)
	.dwattr $C$DW$474, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$474, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$474, DW_AT_decl_column(0x02)

$C$DW$475	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$475, DW_AT_name("SOCKET_3")
	.dwattr $C$DW$475, DW_AT_const_value(0x03)
	.dwattr $C$DW$475, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$475, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$475, DW_AT_decl_column(0x02)

$C$DW$476	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$476, DW_AT_name("SOCKET_4")
	.dwattr $C$DW$476, DW_AT_const_value(0x04)
	.dwattr $C$DW$476, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$476, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$476, DW_AT_decl_column(0x02)

$C$DW$477	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$477, DW_AT_name("SOCKET_5")
	.dwattr $C$DW$477, DW_AT_const_value(0x05)
	.dwattr $C$DW$477, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$477, DW_AT_decl_line(0x60)
	.dwattr $C$DW$477, DW_AT_decl_column(0x02)

$C$DW$478	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$478, DW_AT_name("SOCKET_6")
	.dwattr $C$DW$478, DW_AT_const_value(0x06)
	.dwattr $C$DW$478, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$478, DW_AT_decl_line(0x61)
	.dwattr $C$DW$478, DW_AT_decl_column(0x02)

$C$DW$479	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$479, DW_AT_name("SOCKET_7")
	.dwattr $C$DW$479, DW_AT_const_value(0x07)
	.dwattr $C$DW$479, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$479, DW_AT_decl_line(0x62)
	.dwattr $C$DW$479, DW_AT_decl_column(0x02)

$C$DW$480	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$480, DW_AT_name("MAX_SOCKET_ENUM_IDX")
	.dwattr $C$DW$480, DW_AT_const_value(0x08)
	.dwattr $C$DW$480, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$480, DW_AT_decl_line(0x63)
	.dwattr $C$DW$480, DW_AT_decl_column(0x02)

$C$DW$481	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$481, DW_AT_name("ACCEPT_ID")
	.dwattr $C$DW$481, DW_AT_const_value(0x08)
	.dwattr $C$DW$481, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$481, DW_AT_decl_line(0x64)
	.dwattr $C$DW$481, DW_AT_decl_column(0x05)

$C$DW$482	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$482, DW_AT_name("CONNECT_ID")
	.dwattr $C$DW$482, DW_AT_const_value(0x09)
	.dwattr $C$DW$482, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$482, DW_AT_decl_line(0x65)
	.dwattr $C$DW$482, DW_AT_decl_column(0x05)

$C$DW$483	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$483, DW_AT_name("SELECT_ID")
	.dwattr $C$DW$483, DW_AT_const_value(0x0a)
	.dwattr $C$DW$483, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$483, DW_AT_decl_line(0x66)
	.dwattr $C$DW$483, DW_AT_decl_column(0x02)

$C$DW$484	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$484, DW_AT_name("GETHOSYBYNAME_ID")
	.dwattr $C$DW$484, DW_AT_const_value(0x0b)
	.dwattr $C$DW$484, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$484, DW_AT_decl_line(0x67)
	.dwattr $C$DW$484, DW_AT_decl_column(0x02)

$C$DW$485	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$485, DW_AT_name("GETHOSYBYSERVICE_ID")
	.dwattr $C$DW$485, DW_AT_const_value(0x0c)
	.dwattr $C$DW$485, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$485, DW_AT_decl_line(0x68)
	.dwattr $C$DW$485, DW_AT_decl_column(0x02)

$C$DW$486	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$486, DW_AT_name("PING_ID")
	.dwattr $C$DW$486, DW_AT_const_value(0x0d)
	.dwattr $C$DW$486, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$486, DW_AT_decl_line(0x69)
	.dwattr $C$DW$486, DW_AT_decl_column(0x02)

$C$DW$487	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$487, DW_AT_name("START_STOP_ID")
	.dwattr $C$DW$487, DW_AT_const_value(0x0e)
	.dwattr $C$DW$487, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$487, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$487, DW_AT_decl_column(0x05)

$C$DW$488	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$488, DW_AT_name("RECV_ID")
	.dwattr $C$DW$488, DW_AT_const_value(0x0f)
	.dwattr $C$DW$488, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$488, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$488, DW_AT_decl_column(0x02)

	.dwattr $C$DW$T$365, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$T$365, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$T$365, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$365

$C$DW$T$366	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$366, DW_AT_name("_SlActionID_e")
	.dwattr $C$DW$T$366, DW_AT_type(*$C$DW$T$365)
	.dwattr $C$DW$T$366, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$366, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$T$366, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$T$366, DW_AT_decl_column(0x02)


$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
$C$DW$489	.dwtag  DW_TAG_member
	.dwattr $C$DW$489, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$489, DW_AT_name("Opcode")
	.dwattr $C$DW$489, DW_AT_TI_symbol_name("Opcode")
	.dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$489, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$489, DW_AT_decl_line(0x38)
	.dwattr $C$DW$489, DW_AT_decl_column(0x16)

$C$DW$490	.dwtag  DW_TAG_member
	.dwattr $C$DW$490, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$490, DW_AT_name("TxDescLen")
	.dwattr $C$DW$490, DW_AT_TI_symbol_name("TxDescLen")
	.dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$490, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$490, DW_AT_decl_line(0x39)
	.dwattr $C$DW$490, DW_AT_decl_column(0x16)

$C$DW$491	.dwtag  DW_TAG_member
	.dwattr $C$DW$491, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$491, DW_AT_name("RxDescLen")
	.dwattr $C$DW$491, DW_AT_TI_symbol_name("RxDescLen")
	.dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$491, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$491, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$491, DW_AT_decl_column(0x16)

	.dwattr $C$DW$T$21, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x37)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$21

$C$DW$T$38	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$38, DW_AT_name("_SlCmdCtrl_t")
	.dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$38, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$T$38, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$T$38, DW_AT_decl_column(0x02)

$C$DW$T$367	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$367, DW_AT_type(*$C$DW$T$38)

$C$DW$T$39	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$39, DW_AT_address_class(0x20)


$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x10)
$C$DW$492	.dwtag  DW_TAG_member
	.dwattr $C$DW$492, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$492, DW_AT_name("TxPayloadLen")
	.dwattr $C$DW$492, DW_AT_TI_symbol_name("TxPayloadLen")
	.dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$492, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$492, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$492, DW_AT_decl_column(0x0b)

$C$DW$493	.dwtag  DW_TAG_member
	.dwattr $C$DW$493, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$493, DW_AT_name("RxPayloadLen")
	.dwattr $C$DW$493, DW_AT_TI_symbol_name("RxPayloadLen")
	.dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$493, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$493, DW_AT_decl_line(0x40)
	.dwattr $C$DW$493, DW_AT_decl_column(0x0b)

$C$DW$494	.dwtag  DW_TAG_member
	.dwattr $C$DW$494, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$494, DW_AT_name("ActualRxPayloadLen")
	.dwattr $C$DW$494, DW_AT_TI_symbol_name("ActualRxPayloadLen")
	.dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$494, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$494, DW_AT_decl_line(0x41)
	.dwattr $C$DW$494, DW_AT_decl_column(0x08)

$C$DW$495	.dwtag  DW_TAG_member
	.dwattr $C$DW$495, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$495, DW_AT_name("pTxPayload")
	.dwattr $C$DW$495, DW_AT_TI_symbol_name("pTxPayload")
	.dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$495, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$495, DW_AT_decl_line(0x42)
	.dwattr $C$DW$495, DW_AT_decl_column(0x0c)

$C$DW$496	.dwtag  DW_TAG_member
	.dwattr $C$DW$496, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$496, DW_AT_name("pRxPayload")
	.dwattr $C$DW$496, DW_AT_TI_symbol_name("pRxPayload")
	.dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$496, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$496, DW_AT_decl_line(0x43)
	.dwattr $C$DW$496, DW_AT_decl_column(0x0c)

	.dwattr $C$DW$T$23, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$23

$C$DW$T$40	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$40, DW_AT_name("_SlCmdExt_t")
	.dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$40, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0x44)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x02)

$C$DW$T$41	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$41, DW_AT_address_class(0x20)


$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x0c)
$C$DW$497	.dwtag  DW_TAG_member
	.dwattr $C$DW$497, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$497, DW_AT_name("lenOrPadding")
	.dwattr $C$DW$497, DW_AT_TI_symbol_name("lenOrPadding")
	.dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$497, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$497, DW_AT_decl_line(0x31f)
	.dwattr $C$DW$497, DW_AT_decl_column(0x08)

$C$DW$498	.dwtag  DW_TAG_member
	.dwattr $C$DW$498, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$498, DW_AT_name("sd")
	.dwattr $C$DW$498, DW_AT_TI_symbol_name("sd")
	.dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$498, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$498, DW_AT_decl_line(0x320)
	.dwattr $C$DW$498, DW_AT_decl_column(0x07)

$C$DW$499	.dwtag  DW_TAG_member
	.dwattr $C$DW$499, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$499, DW_AT_name("FamilyAndFlags")
	.dwattr $C$DW$499, DW_AT_TI_symbol_name("FamilyAndFlags")
	.dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$499, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$499, DW_AT_decl_line(0x321)
	.dwattr $C$DW$499, DW_AT_decl_column(0x07)

$C$DW$500	.dwtag  DW_TAG_member
	.dwattr $C$DW$500, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$500, DW_AT_name("port")
	.dwattr $C$DW$500, DW_AT_TI_symbol_name("port")
	.dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$500, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$500, DW_AT_decl_line(0x322)
	.dwattr $C$DW$500, DW_AT_decl_column(0x08)

$C$DW$501	.dwtag  DW_TAG_member
	.dwattr $C$DW$501, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$501, DW_AT_name("paddingOrAddr")
	.dwattr $C$DW$501, DW_AT_TI_symbol_name("paddingOrAddr")
	.dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$501, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$501, DW_AT_decl_line(0x323)
	.dwattr $C$DW$501, DW_AT_decl_column(0x08)

$C$DW$502	.dwtag  DW_TAG_member
	.dwattr $C$DW$502, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$502, DW_AT_name("address")
	.dwattr $C$DW$502, DW_AT_TI_symbol_name("address")
	.dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$502, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$502, DW_AT_decl_line(0x324)
	.dwattr $C$DW$502, DW_AT_decl_column(0x08)

	.dwattr $C$DW$T$24, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0x31e)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$24

$C$DW$T$197	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$197, DW_AT_name("_SocketAddrIPv4Command_t")
	.dwattr $C$DW$T$197, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$197, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$197, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$197, DW_AT_decl_line(0x325)
	.dwattr $C$DW$T$197, DW_AT_decl_column(0x02)


$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x0c)
$C$DW$503	.dwtag  DW_TAG_member
	.dwattr $C$DW$503, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$503, DW_AT_name("lenOrPadding")
	.dwattr $C$DW$503, DW_AT_TI_symbol_name("lenOrPadding")
	.dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$503, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$503, DW_AT_decl_line(0x329)
	.dwattr $C$DW$503, DW_AT_decl_column(0x08)

$C$DW$504	.dwtag  DW_TAG_member
	.dwattr $C$DW$504, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$504, DW_AT_name("sd")
	.dwattr $C$DW$504, DW_AT_TI_symbol_name("sd")
	.dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$504, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$504, DW_AT_decl_line(0x32a)
	.dwattr $C$DW$504, DW_AT_decl_column(0x07)

$C$DW$505	.dwtag  DW_TAG_member
	.dwattr $C$DW$505, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$505, DW_AT_name("FamilyAndFlags")
	.dwattr $C$DW$505, DW_AT_TI_symbol_name("FamilyAndFlags")
	.dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$505, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$505, DW_AT_decl_line(0x32b)
	.dwattr $C$DW$505, DW_AT_decl_column(0x07)

$C$DW$506	.dwtag  DW_TAG_member
	.dwattr $C$DW$506, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$506, DW_AT_name("port")
	.dwattr $C$DW$506, DW_AT_TI_symbol_name("port")
	.dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$506, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$506, DW_AT_decl_line(0x32c)
	.dwattr $C$DW$506, DW_AT_decl_column(0x08)

$C$DW$507	.dwtag  DW_TAG_member
	.dwattr $C$DW$507, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$507, DW_AT_name("address")
	.dwattr $C$DW$507, DW_AT_TI_symbol_name("address")
	.dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$507, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$507, DW_AT_decl_line(0x32d)
	.dwattr $C$DW$507, DW_AT_decl_column(0x07)

	.dwattr $C$DW$T$26, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0x328)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$26

$C$DW$T$198	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$198, DW_AT_name("_SocketAddrIPv6EUI48Command_t")
	.dwattr $C$DW$T$198, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$198, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$198, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$198, DW_AT_decl_line(0x32e)
	.dwattr $C$DW$T$198, DW_AT_decl_column(0x02)


$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x0c)
$C$DW$508	.dwtag  DW_TAG_member
	.dwattr $C$DW$508, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$508, DW_AT_name("statusOrLen")
	.dwattr $C$DW$508, DW_AT_TI_symbol_name("statusOrLen")
	.dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$508, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$508, DW_AT_decl_line(0x302)
	.dwattr $C$DW$508, DW_AT_decl_column(0x08)

$C$DW$509	.dwtag  DW_TAG_member
	.dwattr $C$DW$509, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$509, DW_AT_name("sd")
	.dwattr $C$DW$509, DW_AT_TI_symbol_name("sd")
	.dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$509, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$509, DW_AT_decl_line(0x303)
	.dwattr $C$DW$509, DW_AT_decl_column(0x07)

$C$DW$510	.dwtag  DW_TAG_member
	.dwattr $C$DW$510, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$510, DW_AT_name("family")
	.dwattr $C$DW$510, DW_AT_TI_symbol_name("family")
	.dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$510, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$510, DW_AT_decl_line(0x304)
	.dwattr $C$DW$510, DW_AT_decl_column(0x07)

$C$DW$511	.dwtag  DW_TAG_member
	.dwattr $C$DW$511, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$511, DW_AT_name("port")
	.dwattr $C$DW$511, DW_AT_TI_symbol_name("port")
	.dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$511, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$511, DW_AT_decl_line(0x305)
	.dwattr $C$DW$511, DW_AT_decl_column(0x08)

$C$DW$512	.dwtag  DW_TAG_member
	.dwattr $C$DW$512, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$512, DW_AT_name("paddingOrAddr")
	.dwattr $C$DW$512, DW_AT_TI_symbol_name("paddingOrAddr")
	.dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$512, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$512, DW_AT_decl_line(0x306)
	.dwattr $C$DW$512, DW_AT_decl_column(0x08)

$C$DW$513	.dwtag  DW_TAG_member
	.dwattr $C$DW$513, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$513, DW_AT_name("address")
	.dwattr $C$DW$513, DW_AT_TI_symbol_name("address")
	.dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$513, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$513, DW_AT_decl_line(0x307)
	.dwattr $C$DW$513, DW_AT_decl_column(0x08)

	.dwattr $C$DW$T$27, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x301)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$27

$C$DW$T$200	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$200, DW_AT_name("_SocketAddrAsyncIPv4Response_t")
	.dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$200, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$200, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$200, DW_AT_decl_line(0x308)
	.dwattr $C$DW$T$200, DW_AT_decl_column(0x02)


$C$DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
$C$DW$514	.dwtag  DW_TAG_member
	.dwattr $C$DW$514, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$514, DW_AT_name("statusOrLen")
	.dwattr $C$DW$514, DW_AT_TI_symbol_name("statusOrLen")
	.dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$514, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$514, DW_AT_decl_line(0x30c)
	.dwattr $C$DW$514, DW_AT_decl_column(0x08)

$C$DW$515	.dwtag  DW_TAG_member
	.dwattr $C$DW$515, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$515, DW_AT_name("sd")
	.dwattr $C$DW$515, DW_AT_TI_symbol_name("sd")
	.dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$515, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$515, DW_AT_decl_line(0x30d)
	.dwattr $C$DW$515, DW_AT_decl_column(0x07)

$C$DW$516	.dwtag  DW_TAG_member
	.dwattr $C$DW$516, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$516, DW_AT_name("family")
	.dwattr $C$DW$516, DW_AT_TI_symbol_name("family")
	.dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$516, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$516, DW_AT_decl_line(0x30e)
	.dwattr $C$DW$516, DW_AT_decl_column(0x07)

$C$DW$517	.dwtag  DW_TAG_member
	.dwattr $C$DW$517, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$517, DW_AT_name("port")
	.dwattr $C$DW$517, DW_AT_TI_symbol_name("port")
	.dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$517, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$517, DW_AT_decl_line(0x30f)
	.dwattr $C$DW$517, DW_AT_decl_column(0x08)

$C$DW$518	.dwtag  DW_TAG_member
	.dwattr $C$DW$518, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$518, DW_AT_name("address")
	.dwattr $C$DW$518, DW_AT_TI_symbol_name("address")
	.dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$518, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$518, DW_AT_decl_line(0x310)
	.dwattr $C$DW$518, DW_AT_decl_column(0x07)

	.dwattr $C$DW$T$28, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$28, DW_AT_decl_line(0x30b)
	.dwattr $C$DW$T$28, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$28

$C$DW$T$201	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$201, DW_AT_name("_SocketAddrAsyncIPv6EUI48Response_t")
	.dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$T$201, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$201, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$201, DW_AT_decl_line(0x311)
	.dwattr $C$DW$T$201, DW_AT_decl_column(0x02)


$C$DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
$C$DW$519	.dwtag  DW_TAG_member
	.dwattr $C$DW$519, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$519, DW_AT_name("Opcode")
	.dwattr $C$DW$519, DW_AT_TI_symbol_name("Opcode")
	.dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$519, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$519, DW_AT_decl_line(0x50)
	.dwattr $C$DW$519, DW_AT_decl_column(0x07)

$C$DW$520	.dwtag  DW_TAG_member
	.dwattr $C$DW$520, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$520, DW_AT_name("Len")
	.dwattr $C$DW$520, DW_AT_TI_symbol_name("Len")
	.dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$520, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$520, DW_AT_decl_line(0x51)
	.dwattr $C$DW$520, DW_AT_decl_column(0x07)

	.dwattr $C$DW$T$29, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$29

$C$DW$T$44	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$44, DW_AT_name("_SlGenericHeader_t")
	.dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$44, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$44, DW_AT_decl_line(0x52)
	.dwattr $C$DW$T$44, DW_AT_decl_column(0x02)

$C$DW$T$45	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$45, DW_AT_name("_SlCommandHeader_t")
	.dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$45, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$45, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$T$45, DW_AT_decl_column(0x1c)


$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x03)
$C$DW$521	.dwtag  DW_TAG_member
	.dwattr $C$DW$521, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$521, DW_AT_name("TxPoolCnt")
	.dwattr $C$DW$521, DW_AT_TI_symbol_name("TxPoolCnt")
	.dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$521, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$521, DW_AT_decl_line(0x79)
	.dwattr $C$DW$521, DW_AT_decl_column(0x15)

$C$DW$522	.dwtag  DW_TAG_member
	.dwattr $C$DW$522, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$522, DW_AT_name("TxLockObj")
	.dwattr $C$DW$522, DW_AT_TI_symbol_name("TxLockObj")
	.dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$522, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$522, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$522, DW_AT_decl_column(0x15)

$C$DW$523	.dwtag  DW_TAG_member
	.dwattr $C$DW$523, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$523, DW_AT_name("TxSyncObj")
	.dwattr $C$DW$523, DW_AT_TI_symbol_name("TxSyncObj")
	.dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$523, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$523, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$523, DW_AT_decl_column(0x15)

	.dwattr $C$DW$T$31, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0x78)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$31

$C$DW$T$51	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$51, DW_AT_name("_SlFlowContCB_t")
	.dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$51, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x02)


$C$DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$37, DW_AT_byte_size(0x10)
$C$DW$524	.dwtag  DW_TAG_member
	.dwattr $C$DW$524, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$524, DW_AT_name("pAsyncBuf")
	.dwattr $C$DW$524, DW_AT_TI_symbol_name("pAsyncBuf")
	.dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$524, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$524, DW_AT_decl_line(0x88)
	.dwattr $C$DW$524, DW_AT_decl_column(0x1e)

$C$DW$525	.dwtag  DW_TAG_member
	.dwattr $C$DW$525, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$525, DW_AT_name("ActionIndex")
	.dwattr $C$DW$525, DW_AT_TI_symbol_name("ActionIndex")
	.dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$525, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$525, DW_AT_decl_line(0x89)
	.dwattr $C$DW$525, DW_AT_decl_column(0x0e)

$C$DW$526	.dwtag  DW_TAG_member
	.dwattr $C$DW$526, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$526, DW_AT_name("AsyncEvtHandler")
	.dwattr $C$DW$526, DW_AT_TI_symbol_name("AsyncEvtHandler")
	.dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$526, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$526, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$526, DW_AT_decl_column(0x1d)

$C$DW$527	.dwtag  DW_TAG_member
	.dwattr $C$DW$527, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$527, DW_AT_name("RxMsgClass")
	.dwattr $C$DW$527, DW_AT_TI_symbol_name("RxMsgClass")
	.dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$527, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$527, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$527, DW_AT_decl_column(0x1d)

	.dwattr $C$DW$T$37, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$T$37, DW_AT_decl_line(0x87)
	.dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$37

$C$DW$T$42	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$42, DW_AT_name("AsyncExt_t")
	.dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$42, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x03)


$C$DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x1c)
$C$DW$528	.dwtag  DW_TAG_member
	.dwattr $C$DW$528, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$528, DW_AT_name("pCmdCtrl")
	.dwattr $C$DW$528, DW_AT_TI_symbol_name("pCmdCtrl")
	.dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$528, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$528, DW_AT_decl_line(0x92)
	.dwattr $C$DW$528, DW_AT_decl_column(0x18)

$C$DW$529	.dwtag  DW_TAG_member
	.dwattr $C$DW$529, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$529, DW_AT_name("pTxRxDescBuff")
	.dwattr $C$DW$529, DW_AT_TI_symbol_name("pTxRxDescBuff")
	.dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$529, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$529, DW_AT_decl_line(0x93)
	.dwattr $C$DW$529, DW_AT_decl_column(0x18)

$C$DW$530	.dwtag  DW_TAG_member
	.dwattr $C$DW$530, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$530, DW_AT_name("pCmdExt")
	.dwattr $C$DW$530, DW_AT_TI_symbol_name("pCmdExt")
	.dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$530, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$530, DW_AT_decl_line(0x94)
	.dwattr $C$DW$530, DW_AT_decl_column(0x18)

$C$DW$531	.dwtag  DW_TAG_member
	.dwattr $C$DW$531, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$531, DW_AT_name("AsyncExt")
	.dwattr $C$DW$531, DW_AT_TI_symbol_name("AsyncExt")
	.dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$531, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$531, DW_AT_decl_line(0x95)
	.dwattr $C$DW$531, DW_AT_decl_column(0x1b)

	.dwattr $C$DW$T$43, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$T$43, DW_AT_decl_line(0x91)
	.dwattr $C$DW$T$43, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$43

$C$DW$T$53	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$53, DW_AT_name("_SlFunctionParams_t")
	.dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$53, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$T$53, DW_AT_decl_line(0x96)
	.dwattr $C$DW$T$53, DW_AT_decl_column(0x02)


$C$DW$T$54	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$54, DW_AT_byte_size(0xb8)
$C$DW$532	.dwtag  DW_TAG_member
	.dwattr $C$DW$532, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$532, DW_AT_name("FD")
	.dwattr $C$DW$532, DW_AT_TI_symbol_name("FD")
	.dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$532, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$532, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$532, DW_AT_decl_column(0x26)

$C$DW$533	.dwtag  DW_TAG_member
	.dwattr $C$DW$533, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$533, DW_AT_name("GlobalLockObj")
	.dwattr $C$DW$533, DW_AT_TI_symbol_name("GlobalLockObj")
	.dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$533, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$533, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$533, DW_AT_decl_column(0x26)

$C$DW$534	.dwtag  DW_TAG_member
	.dwattr $C$DW$534, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$534, DW_AT_name("TempProtocolHeader")
	.dwattr $C$DW$534, DW_AT_TI_symbol_name("TempProtocolHeader")
	.dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$534, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$534, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$534, DW_AT_decl_column(0x26)

$C$DW$535	.dwtag  DW_TAG_member
	.dwattr $C$DW$535, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$535, DW_AT_name("pInitCallback")
	.dwattr $C$DW$535, DW_AT_TI_symbol_name("pInitCallback")
	.dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$535, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$535, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$535, DW_AT_decl_column(0x26)

$C$DW$536	.dwtag  DW_TAG_member
	.dwattr $C$DW$536, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$536, DW_AT_name("ObjPool")
	.dwattr $C$DW$536, DW_AT_TI_symbol_name("ObjPool")
	.dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$536, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$536, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$536, DW_AT_decl_column(0x25)

$C$DW$537	.dwtag  DW_TAG_member
	.dwattr $C$DW$537, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$537, DW_AT_name("FreePoolIdx")
	.dwattr $C$DW$537, DW_AT_TI_symbol_name("FreePoolIdx")
	.dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$537, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$537, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$537, DW_AT_decl_column(0x0e)

$C$DW$538	.dwtag  DW_TAG_member
	.dwattr $C$DW$538, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$538, DW_AT_name("PendingPoolIdx")
	.dwattr $C$DW$538, DW_AT_TI_symbol_name("PendingPoolIdx")
	.dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x89]
	.dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$538, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$538, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$538, DW_AT_decl_column(0x0e)

$C$DW$539	.dwtag  DW_TAG_member
	.dwattr $C$DW$539, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$539, DW_AT_name("ActivePoolIdx")
	.dwattr $C$DW$539, DW_AT_TI_symbol_name("ActivePoolIdx")
	.dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
	.dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$539, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$539, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$539, DW_AT_decl_column(0x0e)

$C$DW$540	.dwtag  DW_TAG_member
	.dwattr $C$DW$540, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$540, DW_AT_name("ActiveActionsBitmap")
	.dwattr $C$DW$540, DW_AT_TI_symbol_name("ActiveActionsBitmap")
	.dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$540, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$540, DW_AT_decl_line(0xa4)
	.dwattr $C$DW$540, DW_AT_decl_column(0x0b)

$C$DW$541	.dwtag  DW_TAG_member
	.dwattr $C$DW$541, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$541, DW_AT_name("ProtectionLockObj")
	.dwattr $C$DW$541, DW_AT_TI_symbol_name("ProtectionLockObj")
	.dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
	.dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$541, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$541, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$541, DW_AT_decl_column(0x22)

$C$DW$542	.dwtag  DW_TAG_member
	.dwattr $C$DW$542, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$542, DW_AT_name("CmdSyncObj")
	.dwattr $C$DW$542, DW_AT_TI_symbol_name("CmdSyncObj")
	.dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x91]
	.dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$542, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$542, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$542, DW_AT_decl_column(0x26)

$C$DW$543	.dwtag  DW_TAG_member
	.dwattr $C$DW$543, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$543, DW_AT_name("IsCmdRespWaited")
	.dwattr $C$DW$543, DW_AT_TI_symbol_name("IsCmdRespWaited")
	.dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
	.dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$543, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$543, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$543, DW_AT_decl_column(0x1d)

$C$DW$544	.dwtag  DW_TAG_member
	.dwattr $C$DW$544, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$544, DW_AT_name("FlowContCB")
	.dwattr $C$DW$544, DW_AT_TI_symbol_name("FlowContCB")
	.dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x93]
	.dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$544, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$544, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$544, DW_AT_decl_column(0x26)

$C$DW$545	.dwtag  DW_TAG_member
	.dwattr $C$DW$545, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$545, DW_AT_name("TxSeqNum")
	.dwattr $C$DW$545, DW_AT_TI_symbol_name("TxSeqNum")
	.dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
	.dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$545, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$545, DW_AT_decl_line(0xac)
	.dwattr $C$DW$545, DW_AT_decl_column(0x1d)

$C$DW$546	.dwtag  DW_TAG_member
	.dwattr $C$DW$546, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$546, DW_AT_name("RxIrqCnt")
	.dwattr $C$DW$546, DW_AT_TI_symbol_name("RxIrqCnt")
	.dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x97]
	.dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$546, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$546, DW_AT_decl_line(0xad)
	.dwattr $C$DW$546, DW_AT_decl_column(0x1d)

$C$DW$547	.dwtag  DW_TAG_member
	.dwattr $C$DW$547, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$547, DW_AT_name("RxDoneCnt")
	.dwattr $C$DW$547, DW_AT_TI_symbol_name("RxDoneCnt")
	.dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
	.dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$547, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$547, DW_AT_decl_line(0xae)
	.dwattr $C$DW$547, DW_AT_decl_column(0x1d)

$C$DW$548	.dwtag  DW_TAG_member
	.dwattr $C$DW$548, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$548, DW_AT_name("SocketNonBlocking")
	.dwattr $C$DW$548, DW_AT_TI_symbol_name("SocketNonBlocking")
	.dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x99]
	.dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$548, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$548, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$548, DW_AT_decl_column(0x1d)

$C$DW$549	.dwtag  DW_TAG_member
	.dwattr $C$DW$549, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$549, DW_AT_name("SocketTXFailure")
	.dwattr $C$DW$549, DW_AT_TI_symbol_name("SocketTXFailure")
	.dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
	.dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$549, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$549, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$549, DW_AT_decl_column(0x1a)

$C$DW$550	.dwtag  DW_TAG_member
	.dwattr $C$DW$550, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$550, DW_AT_name("RelayFlagsViaRxPayload")
	.dwattr $C$DW$550, DW_AT_TI_symbol_name("RelayFlagsViaRxPayload")
	.dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x9b]
	.dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$550, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$550, DW_AT_decl_line(0xb1)
	.dwattr $C$DW$550, DW_AT_decl_column(0x1d)

$C$DW$551	.dwtag  DW_TAG_member
	.dwattr $C$DW$551, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$551, DW_AT_name("FunctionParams")
	.dwattr $C$DW$551, DW_AT_TI_symbol_name("FunctionParams")
	.dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
	.dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$551, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$551, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$551, DW_AT_decl_column(0x26)

	.dwattr $C$DW$T$54, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$T$54, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$T$54, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$54

$C$DW$T$369	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$369, DW_AT_name("_SlDriverCb_t")
	.dwattr $C$DW$T$369, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$T$369, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$369, DW_AT_decl_file("../thirdparty/simplelink/source/driver.h")
	.dwattr $C$DW$T$369, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$369, DW_AT_decl_column(0x02)

$C$DW$T$370	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$370, DW_AT_type(*$C$DW$T$369)
	.dwattr $C$DW$T$370, DW_AT_address_class(0x20)


$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x04)
$C$DW$552	.dwtag  DW_TAG_member
	.dwattr $C$DW$552, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$552, DW_AT_name("Domain")
	.dwattr $C$DW$552, DW_AT_TI_symbol_name("Domain")
	.dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$552, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$552, DW_AT_decl_line(0x2e9)
	.dwattr $C$DW$552, DW_AT_decl_column(0x07)

$C$DW$553	.dwtag  DW_TAG_member
	.dwattr $C$DW$553, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$553, DW_AT_name("Type")
	.dwattr $C$DW$553, DW_AT_TI_symbol_name("Type")
	.dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$553, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$553, DW_AT_decl_line(0x2ea)
	.dwattr $C$DW$553, DW_AT_decl_column(0x07)

$C$DW$554	.dwtag  DW_TAG_member
	.dwattr $C$DW$554, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$554, DW_AT_name("Protocol")
	.dwattr $C$DW$554, DW_AT_TI_symbol_name("Protocol")
	.dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$554, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$554, DW_AT_decl_line(0x2eb)
	.dwattr $C$DW$554, DW_AT_decl_column(0x07)

$C$DW$555	.dwtag  DW_TAG_member
	.dwattr $C$DW$555, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$555, DW_AT_name("Padding")
	.dwattr $C$DW$555, DW_AT_TI_symbol_name("Padding")
	.dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$555, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$555, DW_AT_decl_line(0x2ec)
	.dwattr $C$DW$555, DW_AT_decl_column(0x07)

	.dwattr $C$DW$T$55, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x2e8)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$55

$C$DW$T$205	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$205, DW_AT_name("_SocketCommand_t")
	.dwattr $C$DW$T$205, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$T$205, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$205, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$205, DW_AT_decl_line(0x2ed)
	.dwattr $C$DW$T$205, DW_AT_decl_column(0x02)


$C$DW$T$56	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$56, DW_AT_byte_size(0x04)
$C$DW$556	.dwtag  DW_TAG_member
	.dwattr $C$DW$556, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$556, DW_AT_name("statusOrLen")
	.dwattr $C$DW$556, DW_AT_TI_symbol_name("statusOrLen")
	.dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$556, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$556, DW_AT_decl_line(0x2f2)
	.dwattr $C$DW$556, DW_AT_decl_column(0x08)

$C$DW$557	.dwtag  DW_TAG_member
	.dwattr $C$DW$557, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$557, DW_AT_name("sd")
	.dwattr $C$DW$557, DW_AT_TI_symbol_name("sd")
	.dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$557, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$557, DW_AT_decl_line(0x2f3)
	.dwattr $C$DW$557, DW_AT_decl_column(0x08)

$C$DW$558	.dwtag  DW_TAG_member
	.dwattr $C$DW$558, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$558, DW_AT_name("padding")
	.dwattr $C$DW$558, DW_AT_TI_symbol_name("padding")
	.dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$558, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$558, DW_AT_decl_line(0x2f4)
	.dwattr $C$DW$558, DW_AT_decl_column(0x08)

	.dwattr $C$DW$T$56, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$56, DW_AT_decl_line(0x2f1)
	.dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$56

$C$DW$T$206	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$206, DW_AT_name("_SocketResponse_t")
	.dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$206, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$206, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$206, DW_AT_decl_line(0x2f5)
	.dwattr $C$DW$T$206, DW_AT_decl_column(0x02)

$C$DW$T$371	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$371, DW_AT_type(*$C$DW$T$206)
	.dwattr $C$DW$T$371, DW_AT_address_class(0x20)


$C$DW$T$57	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$57, DW_AT_byte_size(0x04)
$C$DW$559	.dwtag  DW_TAG_member
	.dwattr $C$DW$559, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$559, DW_AT_name("sd")
	.dwattr $C$DW$559, DW_AT_TI_symbol_name("sd")
	.dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$559, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$559, DW_AT_decl_line(0x353)
	.dwattr $C$DW$559, DW_AT_decl_column(0x07)

$C$DW$560	.dwtag  DW_TAG_member
	.dwattr $C$DW$560, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$560, DW_AT_name("padding0")
	.dwattr $C$DW$560, DW_AT_TI_symbol_name("padding0")
	.dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$560, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$560, DW_AT_decl_line(0x354)
	.dwattr $C$DW$560, DW_AT_decl_column(0x07)

$C$DW$561	.dwtag  DW_TAG_member
	.dwattr $C$DW$561, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$561, DW_AT_name("padding1")
	.dwattr $C$DW$561, DW_AT_TI_symbol_name("padding1")
	.dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$561, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$561, DW_AT_decl_line(0x355)
	.dwattr $C$DW$561, DW_AT_decl_column(0x07)

$C$DW$562	.dwtag  DW_TAG_member
	.dwattr $C$DW$562, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$562, DW_AT_name("padding2")
	.dwattr $C$DW$562, DW_AT_TI_symbol_name("padding2")
	.dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$562, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$562, DW_AT_decl_line(0x356)
	.dwattr $C$DW$562, DW_AT_decl_column(0x07)

	.dwattr $C$DW$T$57, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$57, DW_AT_decl_line(0x352)
	.dwattr $C$DW$T$57, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$57

$C$DW$T$208	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$208, DW_AT_name("_CloseCommand_t")
	.dwattr $C$DW$T$208, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$T$208, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$208, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$208, DW_AT_decl_line(0x357)
	.dwattr $C$DW$T$208, DW_AT_decl_column(0x02)


$C$DW$T$58	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x04)
$C$DW$563	.dwtag  DW_TAG_member
	.dwattr $C$DW$563, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$563, DW_AT_name("StatusOrLen")
	.dwattr $C$DW$563, DW_AT_TI_symbol_name("StatusOrLen")
	.dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$563, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$563, DW_AT_decl_line(0x38a)
	.dwattr $C$DW$563, DW_AT_decl_column(0x08)

$C$DW$564	.dwtag  DW_TAG_member
	.dwattr $C$DW$564, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$564, DW_AT_name("sd")
	.dwattr $C$DW$564, DW_AT_TI_symbol_name("sd")
	.dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$564, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$564, DW_AT_decl_line(0x38b)
	.dwattr $C$DW$564, DW_AT_decl_column(0x08)

$C$DW$565	.dwtag  DW_TAG_member
	.dwattr $C$DW$565, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$565, DW_AT_name("FamilyAndFlags")
	.dwattr $C$DW$565, DW_AT_TI_symbol_name("FamilyAndFlags")
	.dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$565, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$565, DW_AT_decl_line(0x38c)
	.dwattr $C$DW$565, DW_AT_decl_column(0x07)

	.dwattr $C$DW$T$58, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$58, DW_AT_decl_line(0x389)
	.dwattr $C$DW$T$58, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$58

$C$DW$T$213	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$213, DW_AT_name("_sendRecvCommand_t")
	.dwattr $C$DW$T$213, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$T$213, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$213, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$213, DW_AT_decl_line(0x38d)
	.dwattr $C$DW$T$213, DW_AT_decl_column(0x02)


$C$DW$T$59	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$59, DW_AT_byte_size(0x08)
$C$DW$566	.dwtag  DW_TAG_member
	.dwattr $C$DW$566, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$566, DW_AT_name("GenHeader")
	.dwattr $C$DW$566, DW_AT_TI_symbol_name("GenHeader")
	.dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$566, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$566, DW_AT_decl_line(0x61)
	.dwattr $C$DW$566, DW_AT_decl_column(0x19)

$C$DW$567	.dwtag  DW_TAG_member
	.dwattr $C$DW$567, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$567, DW_AT_name("TxPoolCnt")
	.dwattr $C$DW$567, DW_AT_TI_symbol_name("TxPoolCnt")
	.dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$567, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$567, DW_AT_decl_line(0x62)
	.dwattr $C$DW$567, DW_AT_decl_column(0x17)

$C$DW$568	.dwtag  DW_TAG_member
	.dwattr $C$DW$568, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$568, DW_AT_name("DevStatus")
	.dwattr $C$DW$568, DW_AT_TI_symbol_name("DevStatus")
	.dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$568, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$568, DW_AT_decl_line(0x63)
	.dwattr $C$DW$568, DW_AT_decl_column(0x17)

$C$DW$569	.dwtag  DW_TAG_member
	.dwattr $C$DW$569, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$569, DW_AT_name("SocketTXFailure")
	.dwattr $C$DW$569, DW_AT_TI_symbol_name("SocketTXFailure")
	.dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$569, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$569, DW_AT_decl_line(0x64)
	.dwattr $C$DW$569, DW_AT_decl_column(0x17)

$C$DW$570	.dwtag  DW_TAG_member
	.dwattr $C$DW$570, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$570, DW_AT_name("SocketNonBlocking")
	.dwattr $C$DW$570, DW_AT_TI_symbol_name("SocketNonBlocking")
	.dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$570, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$570, DW_AT_decl_line(0x65)
	.dwattr $C$DW$570, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$59, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$59, DW_AT_decl_line(0x60)
	.dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$59

$C$DW$T$372	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$372, DW_AT_name("_SlResponseHeader_t")
	.dwattr $C$DW$T$372, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$T$372, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$372, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$372, DW_AT_decl_line(0x66)
	.dwattr $C$DW$T$372, DW_AT_decl_column(0x02)


$C$DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
$C$DW$571	.dwtag  DW_TAG_member
	.dwattr $C$DW$571, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$571, DW_AT_name("sd")
	.dwattr $C$DW$571, DW_AT_TI_symbol_name("sd")
	.dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$571, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$571, DW_AT_decl_line(0x34b)
	.dwattr $C$DW$571, DW_AT_decl_column(0x07)

$C$DW$572	.dwtag  DW_TAG_member
	.dwattr $C$DW$572, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$572, DW_AT_name("backlog")
	.dwattr $C$DW$572, DW_AT_TI_symbol_name("backlog")
	.dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$572, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$572, DW_AT_decl_line(0x34c)
	.dwattr $C$DW$572, DW_AT_decl_column(0x07)

$C$DW$573	.dwtag  DW_TAG_member
	.dwattr $C$DW$573, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$573, DW_AT_name("padding1")
	.dwattr $C$DW$573, DW_AT_TI_symbol_name("padding1")
	.dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$573, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$573, DW_AT_decl_line(0x34d)
	.dwattr $C$DW$573, DW_AT_decl_column(0x07)

$C$DW$574	.dwtag  DW_TAG_member
	.dwattr $C$DW$574, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$574, DW_AT_name("padding2")
	.dwattr $C$DW$574, DW_AT_TI_symbol_name("padding2")
	.dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$574, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$574, DW_AT_decl_line(0x34e)
	.dwattr $C$DW$574, DW_AT_decl_column(0x07)

	.dwattr $C$DW$T$60, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$60, DW_AT_decl_line(0x34a)
	.dwattr $C$DW$T$60, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$60

$C$DW$T$218	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$218, DW_AT_name("_ListenCommand_t")
	.dwattr $C$DW$T$218, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$T$218, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$218, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$218, DW_AT_decl_line(0x34f)
	.dwattr $C$DW$T$218, DW_AT_decl_column(0x02)


$C$DW$T$61	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
$C$DW$575	.dwtag  DW_TAG_member
	.dwattr $C$DW$575, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$575, DW_AT_name("status")
	.dwattr $C$DW$575, DW_AT_TI_symbol_name("status")
	.dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$575, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$575, DW_AT_decl_line(0x180)
	.dwattr $C$DW$575, DW_AT_decl_column(0x08)

$C$DW$576	.dwtag  DW_TAG_member
	.dwattr $C$DW$576, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$576, DW_AT_name("padding")
	.dwattr $C$DW$576, DW_AT_TI_symbol_name("padding")
	.dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$576, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$576, DW_AT_decl_line(0x181)
	.dwattr $C$DW$576, DW_AT_decl_column(0x08)

	.dwattr $C$DW$T$61, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$61, DW_AT_decl_line(0x17f)
	.dwattr $C$DW$T$61, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$61

$C$DW$T$219	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$219, DW_AT_name("_BasicResponse_t")
	.dwattr $C$DW$T$219, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$T$219, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$219, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$219, DW_AT_decl_line(0x183)
	.dwattr $C$DW$T$219, DW_AT_decl_column(0x02)

$C$DW$T$374	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$374, DW_AT_name("_DevMaskEventSetResponse_t")
	.dwattr $C$DW$T$374, DW_AT_type(*$C$DW$T$219)
	.dwattr $C$DW$T$374, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$374, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$374, DW_AT_decl_line(0x191)
	.dwattr $C$DW$T$374, DW_AT_decl_column(0x1a)

$C$DW$T$375	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$375, DW_AT_name("_DevUartSetModeResponse_t")
	.dwattr $C$DW$T$375, DW_AT_type(*$C$DW$T$219)
	.dwattr $C$DW$T$375, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$375, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$375, DW_AT_decl_line(0x1c3)
	.dwattr $C$DW$T$375, DW_AT_decl_column(0x1a)

$C$DW$T$376	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$376, DW_AT_name("_FsCloseResponse_t")
	.dwattr $C$DW$T$376, DW_AT_type(*$C$DW$T$219)
	.dwattr $C$DW$T$376, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$376, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$376, DW_AT_decl_line(0x467)
	.dwattr $C$DW$T$376, DW_AT_decl_column(0x1a)

$C$DW$T$377	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$377, DW_AT_name("_FsDeleteResponse_t")
	.dwattr $C$DW$T$377, DW_AT_type(*$C$DW$T$219)
	.dwattr $C$DW$T$377, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$377, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$377, DW_AT_decl_line(0x466)
	.dwattr $C$DW$T$377, DW_AT_decl_column(0x1a)

$C$DW$T$378	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$378, DW_AT_name("_FsFormatResponse_t")
	.dwattr $C$DW$T$378, DW_AT_type(*$C$DW$T$219)
	.dwattr $C$DW$T$378, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$378, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$378, DW_AT_decl_line(0x478)
	.dwattr $C$DW$T$378, DW_AT_decl_column(0x1a)

$C$DW$T$379	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$379, DW_AT_name("_FsReadResponse_t")
	.dwattr $C$DW$T$379, DW_AT_type(*$C$DW$T$219)
	.dwattr $C$DW$T$379, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$379, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$379, DW_AT_decl_line(0x465)
	.dwattr $C$DW$T$379, DW_AT_decl_column(0x1a)

$C$DW$T$380	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$380, DW_AT_name("_FsWriteResponse_t")
	.dwattr $C$DW$T$380, DW_AT_type(*$C$DW$T$219)
	.dwattr $C$DW$T$380, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$380, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$380, DW_AT_decl_line(0x489)
	.dwattr $C$DW$T$380, DW_AT_decl_column(0x1a)

$C$DW$T$381	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$381, DW_AT_name("_NetAppStartStopResponse_t")
	.dwattr $C$DW$T$381, DW_AT_type(*$C$DW$T$219)
	.dwattr $C$DW$T$381, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$381, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$381, DW_AT_decl_line(0x394)
	.dwattr $C$DW$T$381, DW_AT_decl_column(0x1a)

$C$DW$T$382	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$382, DW_AT_name("_WlanGetNetworkListResponse_t")
	.dwattr $C$DW$T$382, DW_AT_type(*$C$DW$T$219)
	.dwattr $C$DW$T$382, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$382, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$382, DW_AT_decl_line(0x225)
	.dwattr $C$DW$T$382, DW_AT_decl_column(0x1a)


$C$DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x04)
$C$DW$577	.dwtag  DW_TAG_member
	.dwattr $C$DW$577, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$577, DW_AT_name("sd")
	.dwattr $C$DW$577, DW_AT_TI_symbol_name("sd")
	.dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$577, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$577, DW_AT_decl_line(0x2f9)
	.dwattr $C$DW$577, DW_AT_decl_column(0x07)

$C$DW$578	.dwtag  DW_TAG_member
	.dwattr $C$DW$578, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$578, DW_AT_name("family")
	.dwattr $C$DW$578, DW_AT_TI_symbol_name("family")
	.dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$578, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$578, DW_AT_decl_line(0x2fa)
	.dwattr $C$DW$578, DW_AT_decl_column(0x07)

$C$DW$579	.dwtag  DW_TAG_member
	.dwattr $C$DW$579, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$579, DW_AT_name("padding1")
	.dwattr $C$DW$579, DW_AT_TI_symbol_name("padding1")
	.dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$579, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$579, DW_AT_decl_line(0x2fb)
	.dwattr $C$DW$579, DW_AT_decl_column(0x07)

$C$DW$580	.dwtag  DW_TAG_member
	.dwattr $C$DW$580, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$580, DW_AT_name("padding2")
	.dwattr $C$DW$580, DW_AT_TI_symbol_name("padding2")
	.dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$580, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$580, DW_AT_decl_line(0x2fc)
	.dwattr $C$DW$580, DW_AT_decl_column(0x07)

	.dwattr $C$DW$T$62, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$62, DW_AT_decl_line(0x2f8)
	.dwattr $C$DW$T$62, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$62

$C$DW$T$221	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$221, DW_AT_name("_AcceptCommand_t")
	.dwattr $C$DW$T$221, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$221, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$221, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$221, DW_AT_decl_line(0x2fd)
	.dwattr $C$DW$T$221, DW_AT_decl_column(0x02)


$C$DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
$C$DW$581	.dwtag  DW_TAG_member
	.dwattr $C$DW$581, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$581, DW_AT_name("sd")
	.dwattr $C$DW$581, DW_AT_TI_symbol_name("sd")
	.dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$581, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$581, DW_AT_decl_line(0x372)
	.dwattr $C$DW$581, DW_AT_decl_column(0x07)

$C$DW$582	.dwtag  DW_TAG_member
	.dwattr $C$DW$582, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$582, DW_AT_name("level")
	.dwattr $C$DW$582, DW_AT_TI_symbol_name("level")
	.dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$582, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$582, DW_AT_decl_line(0x373)
	.dwattr $C$DW$582, DW_AT_decl_column(0x07)

$C$DW$583	.dwtag  DW_TAG_member
	.dwattr $C$DW$583, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$583, DW_AT_name("optionName")
	.dwattr $C$DW$583, DW_AT_TI_symbol_name("optionName")
	.dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$583, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$583, DW_AT_decl_line(0x374)
	.dwattr $C$DW$583, DW_AT_decl_column(0x07)

$C$DW$584	.dwtag  DW_TAG_member
	.dwattr $C$DW$584, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$584, DW_AT_name("optionLen")
	.dwattr $C$DW$584, DW_AT_TI_symbol_name("optionLen")
	.dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$584, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$584, DW_AT_decl_line(0x375)
	.dwattr $C$DW$584, DW_AT_decl_column(0x07)

	.dwattr $C$DW$T$63, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$63, DW_AT_decl_line(0x371)
	.dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$63

$C$DW$T$224	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$224, DW_AT_name("_setSockOptCommand_t")
	.dwattr $C$DW$T$224, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$224, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$224, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$224, DW_AT_decl_line(0x376)
	.dwattr $C$DW$T$224, DW_AT_decl_column(0x02)


$C$DW$T$64	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$64, DW_AT_byte_size(0x04)
$C$DW$585	.dwtag  DW_TAG_member
	.dwattr $C$DW$585, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$585, DW_AT_name("sd")
	.dwattr $C$DW$585, DW_AT_TI_symbol_name("sd")
	.dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$585, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$585, DW_AT_decl_line(0x37a)
	.dwattr $C$DW$585, DW_AT_decl_column(0x07)

$C$DW$586	.dwtag  DW_TAG_member
	.dwattr $C$DW$586, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$586, DW_AT_name("level")
	.dwattr $C$DW$586, DW_AT_TI_symbol_name("level")
	.dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$586, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$586, DW_AT_decl_line(0x37b)
	.dwattr $C$DW$586, DW_AT_decl_column(0x07)

$C$DW$587	.dwtag  DW_TAG_member
	.dwattr $C$DW$587, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$587, DW_AT_name("optionName")
	.dwattr $C$DW$587, DW_AT_TI_symbol_name("optionName")
	.dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$587, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$587, DW_AT_decl_line(0x37c)
	.dwattr $C$DW$587, DW_AT_decl_column(0x07)

$C$DW$588	.dwtag  DW_TAG_member
	.dwattr $C$DW$588, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$588, DW_AT_name("optionLen")
	.dwattr $C$DW$588, DW_AT_TI_symbol_name("optionLen")
	.dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$588, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$588, DW_AT_decl_line(0x37d)
	.dwattr $C$DW$588, DW_AT_decl_column(0x07)

	.dwattr $C$DW$T$64, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$64, DW_AT_decl_line(0x379)
	.dwattr $C$DW$T$64, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$64

$C$DW$T$226	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$226, DW_AT_name("_getSockOptCommand_t")
	.dwattr $C$DW$T$226, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$T$226, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$226, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$226, DW_AT_decl_line(0x37e)
	.dwattr $C$DW$T$226, DW_AT_decl_column(0x02)


$C$DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x04)
$C$DW$589	.dwtag  DW_TAG_member
	.dwattr $C$DW$589, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$589, DW_AT_name("status")
	.dwattr $C$DW$589, DW_AT_TI_symbol_name("status")
	.dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$589, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$589, DW_AT_decl_line(0x382)
	.dwattr $C$DW$589, DW_AT_decl_column(0x08)

$C$DW$590	.dwtag  DW_TAG_member
	.dwattr $C$DW$590, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$590, DW_AT_name("sd")
	.dwattr $C$DW$590, DW_AT_TI_symbol_name("sd")
	.dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$590, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$590, DW_AT_decl_line(0x383)
	.dwattr $C$DW$590, DW_AT_decl_column(0x07)

$C$DW$591	.dwtag  DW_TAG_member
	.dwattr $C$DW$591, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$591, DW_AT_name("optionLen")
	.dwattr $C$DW$591, DW_AT_TI_symbol_name("optionLen")
	.dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$591, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$591, DW_AT_decl_line(0x384)
	.dwattr $C$DW$591, DW_AT_decl_column(0x07)

	.dwattr $C$DW$T$65, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$65, DW_AT_decl_line(0x381)
	.dwattr $C$DW$T$65, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$65

$C$DW$T$227	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$227, DW_AT_name("_getSockOptResponse_t")
	.dwattr $C$DW$T$227, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$T$227, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$227, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$227, DW_AT_decl_line(0x385)
	.dwattr $C$DW$T$227, DW_AT_decl_column(0x02)


$C$DW$T$66	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$66, DW_AT_byte_size(0x0c)
$C$DW$592	.dwtag  DW_TAG_member
	.dwattr $C$DW$592, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$592, DW_AT_name("nfds")
	.dwattr $C$DW$592, DW_AT_TI_symbol_name("nfds")
	.dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$592, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$592, DW_AT_decl_line(0x35c)
	.dwattr $C$DW$592, DW_AT_decl_column(0x07)

$C$DW$593	.dwtag  DW_TAG_member
	.dwattr $C$DW$593, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$593, DW_AT_name("readFdsCount")
	.dwattr $C$DW$593, DW_AT_TI_symbol_name("readFdsCount")
	.dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$593, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$593, DW_AT_decl_line(0x35d)
	.dwattr $C$DW$593, DW_AT_decl_column(0x07)

$C$DW$594	.dwtag  DW_TAG_member
	.dwattr $C$DW$594, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$594, DW_AT_name("writeFdsCount")
	.dwattr $C$DW$594, DW_AT_TI_symbol_name("writeFdsCount")
	.dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$594, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$594, DW_AT_decl_line(0x35e)
	.dwattr $C$DW$594, DW_AT_decl_column(0x07)

$C$DW$595	.dwtag  DW_TAG_member
	.dwattr $C$DW$595, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$595, DW_AT_name("padding")
	.dwattr $C$DW$595, DW_AT_TI_symbol_name("padding")
	.dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$595, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$595, DW_AT_decl_line(0x35f)
	.dwattr $C$DW$595, DW_AT_decl_column(0x07)

$C$DW$596	.dwtag  DW_TAG_member
	.dwattr $C$DW$596, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$596, DW_AT_name("readFds")
	.dwattr $C$DW$596, DW_AT_TI_symbol_name("readFds")
	.dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$596, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$596, DW_AT_decl_line(0x360)
	.dwattr $C$DW$596, DW_AT_decl_column(0x08)

$C$DW$597	.dwtag  DW_TAG_member
	.dwattr $C$DW$597, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$597, DW_AT_name("writeFds")
	.dwattr $C$DW$597, DW_AT_TI_symbol_name("writeFds")
	.dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$597, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$597, DW_AT_decl_line(0x361)
	.dwattr $C$DW$597, DW_AT_decl_column(0x08)

$C$DW$598	.dwtag  DW_TAG_member
	.dwattr $C$DW$598, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$598, DW_AT_name("tv_usec")
	.dwattr $C$DW$598, DW_AT_TI_symbol_name("tv_usec")
	.dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$598, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$598, DW_AT_decl_line(0x362)
	.dwattr $C$DW$598, DW_AT_decl_column(0x08)

$C$DW$599	.dwtag  DW_TAG_member
	.dwattr $C$DW$599, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$599, DW_AT_name("tv_sec")
	.dwattr $C$DW$599, DW_AT_TI_symbol_name("tv_sec")
	.dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$599, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$599, DW_AT_decl_line(0x363)
	.dwattr $C$DW$599, DW_AT_decl_column(0x08)

	.dwattr $C$DW$T$66, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$66, DW_AT_decl_line(0x35b)
	.dwattr $C$DW$T$66, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$66

$C$DW$T$229	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$229, DW_AT_name("_SelectCommand_t")
	.dwattr $C$DW$T$229, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$T$229, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$229, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$229, DW_AT_decl_line(0x364)
	.dwattr $C$DW$T$229, DW_AT_decl_column(0x02)


$C$DW$T$67	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$67, DW_AT_byte_size(0x08)
$C$DW$600	.dwtag  DW_TAG_member
	.dwattr $C$DW$600, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$600, DW_AT_name("status")
	.dwattr $C$DW$600, DW_AT_TI_symbol_name("status")
	.dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$600, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$600, DW_AT_decl_line(0x369)
	.dwattr $C$DW$600, DW_AT_decl_column(0x08)

$C$DW$601	.dwtag  DW_TAG_member
	.dwattr $C$DW$601, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$601, DW_AT_name("readFdsCount")
	.dwattr $C$DW$601, DW_AT_TI_symbol_name("readFdsCount")
	.dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$601, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$601, DW_AT_decl_line(0x36a)
	.dwattr $C$DW$601, DW_AT_decl_column(0x07)

$C$DW$602	.dwtag  DW_TAG_member
	.dwattr $C$DW$602, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$602, DW_AT_name("writeFdsCount")
	.dwattr $C$DW$602, DW_AT_TI_symbol_name("writeFdsCount")
	.dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$602, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$602, DW_AT_decl_line(0x36b)
	.dwattr $C$DW$602, DW_AT_decl_column(0x07)

$C$DW$603	.dwtag  DW_TAG_member
	.dwattr $C$DW$603, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$603, DW_AT_name("readFds")
	.dwattr $C$DW$603, DW_AT_TI_symbol_name("readFds")
	.dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$603, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$603, DW_AT_decl_line(0x36c)
	.dwattr $C$DW$603, DW_AT_decl_column(0x08)

$C$DW$604	.dwtag  DW_TAG_member
	.dwattr $C$DW$604, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$604, DW_AT_name("writeFds")
	.dwattr $C$DW$604, DW_AT_TI_symbol_name("writeFds")
	.dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$604, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$604, DW_AT_decl_line(0x36d)
	.dwattr $C$DW$604, DW_AT_decl_column(0x08)

	.dwattr $C$DW$T$67, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$67, DW_AT_decl_line(0x368)
	.dwattr $C$DW$T$67, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$67

$C$DW$T$383	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$383, DW_AT_name("_SelectAsyncResponse_t")
	.dwattr $C$DW$T$383, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$383, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$383, DW_AT_decl_file("../thirdparty/simplelink/source/protocol.h")
	.dwattr $C$DW$T$383, DW_AT_decl_line(0x36e)
	.dwattr $C$DW$T$383, DW_AT_decl_column(0x02)

$C$DW$T$384	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$384, DW_AT_type(*$C$DW$T$383)
	.dwattr $C$DW$T$384, DW_AT_address_class(0x20)


$C$DW$T$69	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$69, DW_AT_byte_size(0x1c)
$C$DW$605	.dwtag  DW_TAG_member
	.dwattr $C$DW$605, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$605, DW_AT_name("flags")
	.dwattr $C$DW$605, DW_AT_TI_symbol_name("flags")
	.dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$605, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/fs.h")
	.dwattr $C$DW$605, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$605, DW_AT_decl_column(0x0a)

$C$DW$606	.dwtag  DW_TAG_member
	.dwattr $C$DW$606, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$606, DW_AT_name("FileLen")
	.dwattr $C$DW$606, DW_AT_TI_symbol_name("FileLen")
	.dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$606, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/fs.h")
	.dwattr $C$DW$606, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$606, DW_AT_decl_column(0x0b)

$C$DW$607	.dwtag  DW_TAG_member
	.dwattr $C$DW$607, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$607, DW_AT_name("AllocatedLen")
	.dwattr $C$DW$607, DW_AT_TI_symbol_name("AllocatedLen")
	.dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$607, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/fs.h")
	.dwattr $C$DW$607, DW_AT_decl_line(0xa4)
	.dwattr $C$DW$607, DW_AT_decl_column(0x0b)

$C$DW$608	.dwtag  DW_TAG_member
	.dwattr $C$DW$608, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$608, DW_AT_name("Token")
	.dwattr $C$DW$608, DW_AT_TI_symbol_name("Token")
	.dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$608, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/fs.h")
	.dwattr $C$DW$608, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$608, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$69, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/fs.h")
	.dwattr $C$DW$T$69, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$T$69, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$69

$C$DW$T$385	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$385, DW_AT_name("SlFsFileInfo_t")
	.dwattr $C$DW$T$385, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$T$385, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$385, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/fs.h")
	.dwattr $C$DW$T$385, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$T$385, DW_AT_decl_column(0x02)


$C$DW$T$70	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$70, DW_AT_byte_size(0x04)
$C$DW$609	.dwtag  DW_TAG_member
	.dwattr $C$DW$609, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$609, DW_AT_name("KeepaliveEnabled")
	.dwattr $C$DW$609, DW_AT_TI_symbol_name("KeepaliveEnabled")
	.dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$609, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$609, DW_AT_decl_line(0x190)
	.dwattr $C$DW$609, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$70, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$T$70, DW_AT_decl_line(0x18f)
	.dwattr $C$DW$T$70, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$70

$C$DW$T$386	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$386, DW_AT_name("SlSockKeepalive_t")
	.dwattr $C$DW$T$386, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$T$386, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$386, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$T$386, DW_AT_decl_line(0x191)
	.dwattr $C$DW$T$386, DW_AT_decl_column(0x02)


$C$DW$T$71	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$71, DW_AT_byte_size(0x04)
$C$DW$610	.dwtag  DW_TAG_member
	.dwattr $C$DW$610, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$610, DW_AT_name("ReuseaddrEnabled")
	.dwattr $C$DW$610, DW_AT_TI_symbol_name("ReuseaddrEnabled")
	.dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$610, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$610, DW_AT_decl_line(0x195)
	.dwattr $C$DW$610, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$71, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$T$71, DW_AT_decl_line(0x194)
	.dwattr $C$DW$T$71, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$71

$C$DW$T$387	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$387, DW_AT_name("SlSockReuseaddr_t")
	.dwattr $C$DW$T$387, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$T$387, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$387, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$T$387, DW_AT_decl_line(0x196)
	.dwattr $C$DW$T$387, DW_AT_decl_column(0x02)


$C$DW$T$72	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$72, DW_AT_byte_size(0x04)
$C$DW$611	.dwtag  DW_TAG_member
	.dwattr $C$DW$611, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$611, DW_AT_name("Winsize")
	.dwattr $C$DW$611, DW_AT_TI_symbol_name("Winsize")
	.dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$611, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$611, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$611, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$72, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$T$72, DW_AT_decl_line(0x199)
	.dwattr $C$DW$T$72, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$72

$C$DW$T$388	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$388, DW_AT_name("SlSockWinsize_t")
	.dwattr $C$DW$T$388, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$T$388, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$388, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$T$388, DW_AT_decl_line(0x19b)
	.dwattr $C$DW$T$388, DW_AT_decl_column(0x02)


$C$DW$T$73	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$73, DW_AT_byte_size(0x04)
$C$DW$612	.dwtag  DW_TAG_member
	.dwattr $C$DW$612, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$612, DW_AT_name("NonblockingEnabled")
	.dwattr $C$DW$612, DW_AT_TI_symbol_name("NonblockingEnabled")
	.dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$612, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$612, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$612, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$73, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$T$73, DW_AT_decl_line(0x19e)
	.dwattr $C$DW$T$73, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$73

$C$DW$T$389	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$389, DW_AT_name("SlSockNonblocking_t")
	.dwattr $C$DW$T$389, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$T$389, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$389, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$T$389, DW_AT_decl_line(0x1a0)
	.dwattr $C$DW$T$389, DW_AT_decl_column(0x02)


$C$DW$T$74	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$74, DW_AT_byte_size(0x04)
$C$DW$613	.dwtag  DW_TAG_member
	.dwattr $C$DW$613, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$613, DW_AT_name("sd")
	.dwattr $C$DW$613, DW_AT_TI_symbol_name("sd")
	.dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$613, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$613, DW_AT_decl_line(0x1a4)
	.dwattr $C$DW$613, DW_AT_decl_column(0x0b)

$C$DW$614	.dwtag  DW_TAG_member
	.dwattr $C$DW$614, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$614, DW_AT_name("type")
	.dwattr $C$DW$614, DW_AT_TI_symbol_name("type")
	.dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$614, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$614, DW_AT_decl_line(0x1a5)
	.dwattr $C$DW$614, DW_AT_decl_column(0x0b)

$C$DW$615	.dwtag  DW_TAG_member
	.dwattr $C$DW$615, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$615, DW_AT_name("val")
	.dwattr $C$DW$615, DW_AT_TI_symbol_name("val")
	.dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$615, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$615, DW_AT_decl_line(0x1a6)
	.dwattr $C$DW$615, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$74, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$T$74, DW_AT_decl_line(0x1a3)
	.dwattr $C$DW$T$74, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$74

$C$DW$T$75	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$75, DW_AT_name("SlSocketAsyncEvent_t")
	.dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$75, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$T$75, DW_AT_decl_line(0x1a7)
	.dwattr $C$DW$T$75, DW_AT_decl_column(0x03)


$C$DW$T$76	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$76, DW_AT_byte_size(0x08)
$C$DW$616	.dwtag  DW_TAG_member
	.dwattr $C$DW$616, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$616, DW_AT_name("status")
	.dwattr $C$DW$616, DW_AT_TI_symbol_name("status")
	.dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$616, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$616, DW_AT_decl_line(0x1ab)
	.dwattr $C$DW$616, DW_AT_decl_column(0x12)

$C$DW$617	.dwtag  DW_TAG_member
	.dwattr $C$DW$617, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$617, DW_AT_name("sd")
	.dwattr $C$DW$617, DW_AT_TI_symbol_name("sd")
	.dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$617, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$617, DW_AT_decl_line(0x1ac)
	.dwattr $C$DW$617, DW_AT_decl_column(0x10)

$C$DW$618	.dwtag  DW_TAG_member
	.dwattr $C$DW$618, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$618, DW_AT_name("socketAsyncEvent")
	.dwattr $C$DW$618, DW_AT_TI_symbol_name("socketAsyncEvent")
	.dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$618, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$618, DW_AT_decl_line(0x1ad)
	.dwattr $C$DW$618, DW_AT_decl_column(0x19)

	.dwattr $C$DW$T$76, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$T$76, DW_AT_decl_line(0x1aa)
	.dwattr $C$DW$T$76, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$76

$C$DW$T$77	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$77, DW_AT_name("SlSockEventData_t")
	.dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$77, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$T$77, DW_AT_decl_line(0x1ae)
	.dwattr $C$DW$T$77, DW_AT_decl_column(0x03)


$C$DW$T$78	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$78, DW_AT_byte_size(0x0c)
$C$DW$619	.dwtag  DW_TAG_member
	.dwattr $C$DW$619, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$619, DW_AT_name("Event")
	.dwattr $C$DW$619, DW_AT_TI_symbol_name("Event")
	.dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$619, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$619, DW_AT_decl_line(0x1b3)
	.dwattr $C$DW$619, DW_AT_decl_column(0x1c)

$C$DW$620	.dwtag  DW_TAG_member
	.dwattr $C$DW$620, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$620, DW_AT_name("EventData")
	.dwattr $C$DW$620, DW_AT_TI_symbol_name("EventData")
	.dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$620, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$620, DW_AT_decl_line(0x1b4)
	.dwattr $C$DW$620, DW_AT_decl_column(0x1c)

	.dwattr $C$DW$T$78, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$T$78, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$T$78, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$78

$C$DW$T$390	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$390, DW_AT_name("SlSockEvent_t")
	.dwattr $C$DW$T$390, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$T$390, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$390, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$T$390, DW_AT_decl_line(0x1b5)
	.dwattr $C$DW$T$390, DW_AT_decl_column(0x03)


$C$DW$T$79	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$79, DW_AT_byte_size(0x04)
$C$DW$621	.dwtag  DW_TAG_member
	.dwattr $C$DW$621, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$621, DW_AT_name("secureMask")
	.dwattr $C$DW$621, DW_AT_TI_symbol_name("secureMask")
	.dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$621, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$621, DW_AT_decl_line(0x1ba)
	.dwattr $C$DW$621, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$79, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$T$79, DW_AT_decl_line(0x1b9)
	.dwattr $C$DW$T$79, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$79

$C$DW$T$391	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$391, DW_AT_name("SlSockSecureMask")
	.dwattr $C$DW$T$391, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$T$391, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$391, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$T$391, DW_AT_decl_line(0x1bb)
	.dwattr $C$DW$T$391, DW_AT_decl_column(0x03)


$C$DW$T$80	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$80, DW_AT_byte_size(0x01)
$C$DW$622	.dwtag  DW_TAG_member
	.dwattr $C$DW$622, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$622, DW_AT_name("secureMethod")
	.dwattr $C$DW$622, DW_AT_TI_symbol_name("secureMethod")
	.dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$622, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$622, DW_AT_decl_line(0x1bf)
	.dwattr $C$DW$622, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$80, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$T$80, DW_AT_decl_line(0x1be)
	.dwattr $C$DW$T$80, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$80

$C$DW$T$392	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$392, DW_AT_name("SlSockSecureMethod")
	.dwattr $C$DW$T$392, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$T$392, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$392, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$T$392, DW_AT_decl_line(0x1c0)
	.dwattr $C$DW$T$392, DW_AT_decl_column(0x03)


$C$DW$T$82	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$82, DW_AT_byte_size(0x08)
$C$DW$623	.dwtag  DW_TAG_member
	.dwattr $C$DW$623, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$623, DW_AT_name("imr_multiaddr")
	.dwattr $C$DW$623, DW_AT_TI_symbol_name("imr_multiaddr")
	.dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$623, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$623, DW_AT_decl_line(0x1cc)
	.dwattr $C$DW$623, DW_AT_decl_column(0x12)

$C$DW$624	.dwtag  DW_TAG_member
	.dwattr $C$DW$624, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$624, DW_AT_name("imr_interface")
	.dwattr $C$DW$624, DW_AT_TI_symbol_name("imr_interface")
	.dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$624, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$624, DW_AT_decl_line(0x1cd)
	.dwattr $C$DW$624, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$82, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$T$82, DW_AT_decl_line(0x1cb)
	.dwattr $C$DW$T$82, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$82

$C$DW$T$393	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$393, DW_AT_name("SlSockIpMreq")
	.dwattr $C$DW$T$393, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$T$393, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$393, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$T$393, DW_AT_decl_line(0x1ce)
	.dwattr $C$DW$T$393, DW_AT_decl_column(0x03)


$C$DW$T$83	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$83, DW_AT_byte_size(0x0c)
$C$DW$625	.dwtag  DW_TAG_member
	.dwattr $C$DW$625, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$625, DW_AT_name("ip")
	.dwattr $C$DW$625, DW_AT_TI_symbol_name("ip")
	.dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$625, DW_AT_decl_file("/home/vishal/workspace_v8/My_project/thirdparty/simplelink/include/socket.h")
	.dwattr $C$DW$625, DW_AT_decl_line(0x204)
	.dwattr $C$DW$625, DW_AT_decl_column(0x0a)

$C$DW$626	.dwtag  DW_TAG_member
	.dwattr $C$DW$626, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$626, DW_AT_name("gateway")
